---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallBaseConstraint
source: html/f42dd3e1-036d-ac7f-72ff-1caea8ea2b37.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallBaseConstraint Property

"Base Constraint"

## Syntax (C#)
```csharp
public static ForgeTypeId WallBaseConstraint { get; }
```